https://www.tickcounter.com/countdown/2796807/meet-rachel-in
爱很简单(live) - 张学友
身边 - 无印良品
喜欢你 - beyond
情非利己 - 庾澄庆
每天爱你多一些 - 张学友 
天使 - 五月天
Hero - Enrique Iglesias
等你的心 - 无印良品
想念 - 袁惟仁
我要我们在一起 - 范晓萱
明明很爱你 - 品冠，梁静茹
约定 - 周蕙
这是我一生中最勇敢的瞬间 - 棱镜
爱你 - 陈芳语
形容 - 沈以诚
那些你很冒险的梦 - 林俊杰
温柔 - 五月天
总有一天你会出现在我面前 - 棱镜
As Long As You Love Me - Back Street Boys
勇气 - 梁静茹
Yellow - Cold Play
我愿意 - 王菲
至少还有你 - 林忆莲
简单爱 - 周杰伦
当 - 动力火车
雨蝶 - 李翊君
小幸运 - Hebe
我们的歌 - 王力宏
爱的就是你 - 王力宏
天下无双 - 张学友(陈奕迅)
稻香 - 周杰伦
情人 - Beyond
星晴 - 周杰伦
影响 - 刘盼/刘杰
爱就一个字 - 张信哲
爱江山更爱美人 - 李丽芬
但愿人长久(live) - 张学友
月亮代表我的心 - 邓丽君
梁山伯与茱丽叶 - 曹格/卓文萱
小小的太阳 - 张宇
Mojito - 周杰伦
彩虹 - 羽泉
最浪漫的事 - 赵咏华
彩虹 - 周杰伦
如果没有你 - 莫文蔚
真相是真 - 阿鸣
想你的365天 - 李玟
爱情 - 莫文蔚
画地为牢 - 羽泉
传奇 - 李健
你是我今生唯一传奇 - 张学友
大城小爱 - 王力宏
小手拉大手 - 梁静茹
right here waiting
no matter what - boys zone
my love - westlife
味道(live) - 张学友
告白气球 - 周杰伦
青花瓷 - 周杰伦
想见你 - 无印良品
灰姑娘 - 郑钧
恋恋风尘 - 老狼
最美的期待 周笔畅
死了都要爱 - 信乐团
fly me to the moon -EVA
春泥 - 庾澄庆
你知道我在等你吗
世界末日 - 周杰伦
唯一 - 王力宏
很爱很爱你 - 刘若英
亲爱的你怎么不在我身边
就是爱你 - 陶喆
成为彼此宇宙的终极浪漫 - 棱镜
心云 - 林志颖
Remember me
倔强 - 五月天
因为你，所以我
童话 - 光良
不可能错过你 - 王力宏
夜空中最亮的星
其实不想走
天使 - 羽泉
独家记忆
鬼迷心窍
月半小夜曲
you're beautiful 
偏偏喜欢你
出现又离开
从开始到现在
为你我受冷风吹
我只在乎你
世界末日
离不开你
->
一生所爱
终于等到你 - 张靓颖
nothing's gonna change my love for you
孤枕难眠
相见恨晚
凤凰花开的路口


爱很简单
天下无双
至少还有你
我愿意
相见恨晚
最熟悉的陌生人
从开始到现在

出现又离开

